---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError
source: html/b7ad5d2a-4630-dc18-c5ba-cf79a2e7aeb7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError Property

The selected fitting(s) cannot successfully change the type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }
```